---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExternalDataInstanceAddingIntoDocumentEventArgs Properties
ExternalDataInstanceAddingIntoDocumentEventArgs Class See Also Send Feedback
---

The ExternalDataInstanceAddingIntoDocumentEventArgs type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
|  | Document | The document associated with the event.  (Inherited from RevitAPIPreDocEventArgs.) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |
|  | TypeId | The type id of the newl external data instance that is being added. |

# See Also

ExternalDataInstanceAddingIntoDocumentEventArgs Class

Autodesk.Revit.DB.Events Namespace